def enter_side_length():
    """Тут користувач вводить дожвину усіх сторін трикутника"""
    a = int(input(f"Довжина першої сторони дорівнює: "))
    b = int(input(f"Довжина другої сторони дорівнює: "))
    c = int(input(f"Довжина третьої сторони дорівнює: "))
    return a, b, c

def requirments(a, b , c):
    """Опис умов зігдно з якими можна буде визначити
    до якого типу належить трикутник"""

    if a == b == c:
        print("Цей трикутник рівносторонній.")
    elif a == b or a == c or b == c:
        print("Цей трикутник рівнобедрений.")
    else:
        print("Цей трикутник різносторонній.")

a, b, c, = enter_side_length()

requirments(a,b, c)

